# frozen_string_literal: true

# for Erlang
brew 'autoconf'
brew 'fop'
brew 'libiodbc'
brew 'openjdk'

# SQLite3
brew 'sqlite'

# Taskfile task runner
brew 'go-task'

# image manipulation
brew 'imagemagick'

# json querying + pretty printing
brew 'jq'

# json exploration
brew 'fx'

# html querying aka hq
brew 'htmlq'

# easily copy tabular data
brew 'yank'

# format postgres sql files
brew 'pgformatter'

# required for formatting terraform files
brew 'opentofu'

# Postgres pager
brew 'pspg'

# Postgres client
brew 'libpq'

# for NeoVim
brew 'lua'

# quickly jump to recently used folders
brew 'autojump'

# better cat with syntax highlighting
brew 'bat'

# compile C stuff
brew 'cmake'

# auto run env scripts when entering a dir
brew 'direnv'

# fuzzy finder
brew 'fzf'

# c++ compiler
brew 'gcc'

# source control
brew 'git'

# GTags for use in Vim
brew 'global'

# Encryption + verification of signed downloads
brew 'gnupg'

# keep grep up to date
brew 'grep'

# show active process and their telemetry
brew 'htop'
brew 'btop'

# GitHub CLIs
brew 'gh'

# docker desktop for containers
cask 'docker'

# curses interface for docker + git
brew 'lazydocker'
brew 'lazygit'

# build tool
brew 'make'

# terminal multiplexer
brew 'tmux'

# download files from the terminal, used by some scripts
brew 'wget'

# Reattach process (e.g., TMux) to background
brew 'reattach-to-user-namespace'

# display system info
brew 'neofetch'

# best code editor on planet earth
brew 'neovim'

# OpenSSL - important for compiling things that support SSL
brew 'openssl@1.1'

# better, faster grep
brew 'ripgrep'

# like grep but for files and folder names
brew 'fd'

# linter for bash scripts
brew 'shellcheck'

# keep tree up to date
brew 'tree'

# keep ZSH up to date
brew 'zsh'

# required by ccls
brew 'llvm'

# the watch command
brew 'watch'

# set default application for opening files on mac
brew 'duti'

# for Nerves
brew 'xz'
brew 'pkg-config'
brew 'squashfs'
brew 'fwup'

# GNU File, Shell, and Text utilities (also required by Nerves)
# https://www.gnu.org/software/coreutils
brew 'coreutils'

# TUI utils for scripting
brew 'gum'

# a modern API client with a friendly DX
brew 'httpie'

# a more up to date version of curl than what macOS offers
brew 'curl'

# run things in parallel
brew 'parallel'

# ask questions in natural language and get results in the terminal
brew 'howdoi'

# pretty text display utils
brew 'figlet'

# kubernetes tools
brew 'kubernetes-cli'
brew 'kubectx'
brew 'helm'

# yet another tmux session manager
brew 'smug'

# for formatting XML files
brew 'xq'

# better shell completions
brew 'carapace'
